const audioPlayer = document.getElementById("audio");
const karaoke = document.getElementById("karaoke");
let currentIndex = 0;
let startTime,
  endTime = 0;
let karaText, karaTextHighlight;

let audioInterval;

const words = [
  ["Về Đâu Mái Tóc Người Thương - Quang Lê", 10.144, 25.587997],
  ["Hồn", 35.144, 35.587997],
  ["lỡ", 35.587997, 36.006],
  ["sa", 36.006, 36.475998],
  ["vào", 36.475998, 36.972],
  ["đôi", 36.972, 37.495],
  ["mắt", 37.495, 37.939],
  ["em", 37.939, 42.641],
  ["Chiều", 42.641, 43.085],
  ["nao", 43.085, 43.476997],
  ["xõa", 43.476997, 43.869],
  ["tóc", 43.869, 44.443],
  ["ngồi", 44.443, 45.017998],
  ["bên", 45.017998, 45.488],
  ["rèm", 45.488, 49.276],
  ["Thầm", 49.276, 49.694],
  ["ước", 49.694, 50.059998],
  ["nhưng", 50.059998, 50.503998],
  ["nào", 50.503998, 51.026],
  ["đâu", 51.026, 51.575],
  ["dám", 51.575, 52.097],
  ["nói", 52.097, 53.325],
  ["Khép", 53.325, 53.769],
  ["tâm", 53.769, 54.37],
  ["tư", 54.37, 54.971],
  ["lại", 54.971, 55.415],
  ["thôi", 55.415, 56.669],
  ["Đường", 56.669, 57.139],
  ["hoa", 57.139, 57.766],
  ["vẫn", 57.766, 57.922],
  ["chưa", 57.922, 58.471],
  ["mở", 58.471, 58.940998],
  ["lối", 58.940998, 62.572],
  ["Đời", 62.572, 63.042],
  ["lắm", 63.042, 63.408],
  ["phong", 63.408, 63.8],
  ["trần", 63.8, 64.34901],
  ["tay", 64.34901, 64.949005],
  ["trắng", 64.949005, 65.289],
  ["tay", 65.289, 69.26],
  ["Trời", 69.26, 69.73],
  ["đông", 69.73, 70.122],
  ["ngại", 70.122, 70.513],
  ["gió", 70.513, 71.036],
  ["lùa", 71.036, 71.637],
  ["vai", 71.637, 72.133],
  ["gầy", 72.133, 75.973],
  ["Lầu", 75.973, 76.39101],
  ["kín", 76.39101, 76.783005],
  ["trăng", 76.783005, 77.149],
  ["về", 77.149, 77.723],
  ["không", 77.723, 78.272],
  ["lối", 78.272, 78.768005],
  ["chiếu", 78.768005, 80.100006],
  ["Gác", 80.100006, 80.518005],
  ["cao", 80.518005, 81.171005],
  ["ngăn", 81.171005, 81.746],
  ["niềm", 81.746, 82.269005],
  ["yêu", 82.269005, 83.444],
  ["Thì", 83.444, 83.888],
  ["thôi", 83.888, 84.515],
  ["mơ", 84.515, 84.672005],
  ["ước", 84.672005, 85.168],
  ["chi", 85.168, 85.769005],
  ["nhiều", 85.769005, 91.411],
  ["Bên", 91.411, 92.117004],
  ["nhau", 92.117004, 93.292],
  ["sao", 93.292, 93.815],
  ["tình", 93.815, 94.416],
  ["xa", 94.416, 95.042],
  ["vạn", 95.042, 95.539],
  ["lý", 95.539, 96.740005],
  ["cách", 96.740005, 97.263],
  ["biệt", 97.263, 97.838005],
  ["mấy", 97.838005, 98.491005],
  ["sơn", 98.491005, 98.935005],
  ["khê", 98.935005, 101.233],
  ["Ngày", 101.233, 102.148],
  ["đi", 102.148, 103.34901],
  ["mắt", 103.34901, 103.767006],
  ["em", 103.767006, 104.473],
  ["xanh", 104.473, 105.126],
  ["biển", 105.126, 105.596],
  ["sâu,", 105.596, 106.719],
  ["mắt", 106.719, 107.137],
  ["tôi", 107.137, 107.921005],
  ["rưng", 107.921005, 108.469],
  ["rưng", 108.469, 108.913],
  ["sầu", 108.913, 110.455],
  ["Lặng", 110.455, 111.108],
  ["nghe", 111.108, 111.709],
  ["tiếng", 111.709, 112.205],
  ["pháo", 112.205, 112.962006],
  ["tiễn", 112.962006, 113.824005],
  ["ai", 113.824005, 114.582],
  ["qua", 114.582, 114.922005],
  ["cầu", 114.922005, 115.496],
  ["Đường", 115.496, 116.228004],
  ["phố", 116.228004, 116.72401],
  ["muôn", 116.72401, 117.064],
  ["màu", 117.064, 117.534004],
  ["sao", 117.534004, 118.082],
  ["thiếu", 118.082, 118.579],
  ["em", 118.579, 122.628006],
  ["Về", 122.628006, 123.046005],
  ["đâu", 123.046005, 123.464005],
  ["làn", 123.464005, 123.882],
  ["tóc", 123.882, 124.404],
  ["xõa", 124.404, 124.979004],
  ["bên", 124.979004, 125.449005],
  ["rèm", 125.449005, 129.263],
  ["Lầu", 129.263, 129.707],
  ["vắng", 129.707, 130.073],
  ["không", 130.073, 130.464],
  ["người", 130.464, 131.118],
  ["song", 131.118, 131.666],
  ["khép", 131.666, 132.18901],
  ["kín", 132.18901, 133.46901],
  ["Nhớ", 133.46901, 133.91301],
  ["em", 133.91301, 134.461],
  ["tôi", 134.461, 135.088],
  ["gọi", 135.088, 135.584],
  ["tên,", 135.584, 136.70801],
  ["chỉ", 136.70801, 137.20401],
  ["nghe", 137.20401, 137.85701],
  ["tiếng", 137.85701, 138.171],
  ["lá", 138.171, 139.059],
  ["rơi", 139.059, 139.58101],
  ["thềm", 139.58101, 168.10701],
  ["Bên", 168.10701, 169.021],
  ["nhau", 169.021, 170.06601],
  ["sao", 170.06601, 170.48401],
  ["tình", 170.48401, 171.11101],
  ["xa", 171.11101, 171.738],
  ["vạn", 171.738, 172.20801],
  ["lý", 172.20801, 173.358],
  ["cách", 173.358, 173.828],
  ["biệt", 173.828, 174.429],
  ["mấy", 174.429, 175.134],
  ["sơn", 175.134, 175.552],
  ["khê", 175.552, 177.981],
  ["Ngày", 177.981, 178.713],
  ["đi", 178.713, 180.019],
  ["mắt", 180.019, 180.489],
  ["em", 180.489, 181.09],
  ["xanh", 181.09, 181.743],
  ["biển", 181.743, 182.161],
  ["sâu,", 182.161, 183.389],
  ["mắt", 183.389, 183.83301],
  ["tôi", 183.83301, 184.46],
  ["rưng", 184.46, 185.087],
  ["rưng", 185.087, 185.531],
  ["sầu", 185.531, 187.15001],
  ["Lặng", 187.15001, 187.856],
  ["nghe", 187.856, 188.378],
  ["tiếng", 188.378, 188.639],
  ["pháo", 188.639, 189.031],
  ["tiễn", 189.031, 189.58],
  ["ai", 189.58, 189.97101],
  ["qua", 189.97101, 191.878],
  ["cầu", 191.878, 192.479],
  ["Đường", 192.479, 192.949],
  ["phố", 192.949, 193.472],
  ["muôn", 193.472, 193.864],
  ["màu", 193.864, 194.464],
  ["sao", 194.464, 195.039],
  ["thiếu", 195.039, 195.536],
  ["em", 195.536, 199.271],
  ["Về", 199.271, 199.68901],
  ["đâu", 199.68901, 200.133],
  ["làn", 200.133, 200.52501],
  ["tóc", 200.52501, 201.047],
  ["xõa", 201.047, 201.62201],
  ["bên", 201.62201, 202.144],
  ["rèm", 202.144, 205.932],
  ["Lầu", 205.932, 206.35],
  ["vắng", 206.35, 206.742],
  ["không", 206.742, 207.108],
  ["người", 207.108, 207.709],
  ["song", 207.709, 208.336],
  ["khép", 208.336, 208.806],
  ["kín", 208.806, 210.033],
  ["Nhớ", 210.033, 210.478],
  ["em", 210.478, 211.104],
  ["tôi", 211.104, 211.627],
  ["gọi", 211.627, 212.149],
  ["tên,", 212.149, 213.429],
  ["chỉ", 213.429, 213.90001],
  ["nghe", 213.90001, 214.709],
  ["tiếng", 214.709, 215.284],
  ["lá", 215.284, 215.493],
  ["rơi", 215.493, 215.83301],
  ["thềm", 215.83301, 219.307],
  ["Lầu", 219.307, 219.699],
  ["vắng", 219.699, 220.117],
  ["không", 220.117, 220.535],
  ["người", 220.535, 221.162],
  ["song", 221.162, 221.684],
  ["khép", 221.684, 222.233],
  ["kín", 222.233, 223.513],
  ["Nhớ", 223.513, 223.904],
  ["em", 223.904, 224.558],
  ["tôi", 224.558, 225.184],
  ["gọi", 225.184, 225.602],
  ["tên,", 225.602, 226.935],
  ["chỉ", 226.935, 229.05101],
  ["nghe", 229.05101, 232.96901],
  ["tiếng", 232.96901, 234.06601],
  ["lá", 234.06601, 235.13701],
  ["rơi", 235.13701, 236.522],
  ["thềm", 236.522, 238.13701],
  ["...", , ]
];

audioPlayer.addEventListener("play", function () {
  audioInterval = setInterval(function () {
      if (audioPlayer.currentTime - startTime >= 0) {
          let duration = endTime - startTime;
          if (endTime - audioPlayer.currentTime > 0) {
              let ratio = (100 / duration) * (endTime - audioPlayer.currentTime) - 100;
              karaTextHighlight.style.width = ratio * -1 + "%";
          } else {
              currentIndex++;
              nextWord(currentIndex);
          }
      }
  }, 1000 / 60);
});

audioPlayer.addEventListener("pause", function () {
  clearInterval(audioInterval);
});

audioPlayer.addEventListener("seeked", function () {
  currentIndex = findWordIndex();
  if (!words[currentIndex]) {
      return;
  }

  nextWord(currentIndex);
});

const nextWord = function (index) {
  if (!words[currentIndex]) {
      return;
  }

  let word = words[index];

  karaText.textContent = word[0];
  karaTextHighlight.textContent = word[0];
  karaTextHighlight.style.width = "0%";

  startTime = word[1];
  endTime = word[2];
};

const findWordIndex = function () {
  if (audioPlayer.currentTime === 0) {
      return 0;
  }
  for (let i = 0; i < words.length; i++) {
      if (audioPlayer.currentTime >= words[i][1] && audioPlayer.currentTime <= words[i][2]) {
          return i;
      } else if (words[i][1] >= audioPlayer.currentTime) {
          return i;
      }
  }
  return words.length;
};

const init = function () {
  let word = words[0];

  karaText = document.createTextNode(word[0]);

  let karaTextLine = document.createElement("div");
  karaTextLine.classList.add("kara-text");

  karaTextHighlight = document.createElement("div");
  karaTextHighlight.classList.add("kara-text-highlight");
  karaTextHighlight.textContent = word[0];
  karaTextHighlight.style.width = "0%";

  karaTextLine.appendChild(karaText);
  karaTextLine.appendChild(karaTextHighlight);

  karaoke.appendChild(karaTextLine);

  startTime = word[1];
  endTime = word[2];
};

init();
